{"keras_version": "2.0.3", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Lambda", "config": {"trainable": true, "dtype": "float32", "name": "lambda_16", "batch_input_shape": [null, 66, 200, 3], "output_shape_type": "raw", "function_type": "lambda", "output_shape": null, "arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-37-8d2dde60d2c9>\u00da\b<lambda>\b\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "strides": [2, 2], "activation": "elu", "bias_constraint": null, "trainable": true, "name": "conv2d_76", "kernel_size": [5, 5], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 24}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_18", "trainable": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "strides": [2, 2], "activation": "elu", "bias_constraint": null, "trainable": true, "name": "conv2d_77", "kernel_size": [5, 5], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 36}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "strides": [1, 1], "activation": "elu", "bias_constraint": null, "trainable": true, "name": "conv2d_78", "kernel_size": [5, 5], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 48}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "name": "batch_normalization_19", "trainable": true, "center": true, "gamma_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "strides": [1, 1], "activation": "elu", "bias_constraint": null, "trainable": true, "name": "conv2d_79", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "strides": [1, 1], "activation": "elu", "bias_constraint": null, "trainable": true, "name": "conv2d_80", "kernel_size": [3, 3], "padding": "valid", "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_regularizer": null, "kernel_constraint": null, "use_bias": true, "filters": 64}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_16"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activation": "elu", "name": "dense_76", "units": 1164, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_35"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activation": "elu", "name": "dense_77", "units": 100, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_36"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activation": "elu", "name": "dense_78", "units": 50, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_37"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activation": "elu", "name": "dense_79", "units": 10, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_38"}}, {"class_name": "Dense", "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "activation": "linear", "name": "dense_80", "units": 1, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null}}]}